app/views/cart/index.html.erb

<% @cart.each do | id, quantity | %>
            <% product = Product.find_by_id(id) %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]