app/controllers/charges_controller.rb

  def create
    order = Order.new
    # order.user = User.find(1)
    # order.product = Product.find(2)
    order.user_id_id = 2
    order.product_id_id = 2
    order.payment_id = 1
    order.name = params[:fname][:fname]
    order.address = params[:address1][:address1]
    order.city = params[:city][:city]
    order.contact = params[:contact][:contact]
    order.save
---
INSERT INTO "orders" ("user_id_id", "product_id_id", "payment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id_id", 2], ["product_id_id", 2], ["payment_id", 1], ["created_at", "2016-05-27 08:49:38.866524"], ["updated_at", "2016-05-27 08:49:38.866524"]]