app/controllers/products_controller.rb

  def index
    @products = Product.all.page(params[:page]).per(2)
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "productImage_file_name", "productImage_content_type", "quantity", "price", "category", "subcategory", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "productImage_file_name" = ?, "productImage_content_type" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["productImage_file_name", "玫瑰.jpg"], ["productImage_content_type", "image/jpeg"], ["updated_at", "2016-05-04 17:50:44.397455"], ["id", 1]]